import 'package:google_maps_flutter/google_maps_flutter.dart';

class Place {
  final String id;
  final LatLng location;
  final String name;
  final String description;

  Place(this.id, this.location, this.name, this.description);
}

List<Place> GetPlaces() {
  var places = [
    Place(
      '1',
      const LatLng(50.446667, 30.5125),
      'Національна Опера',
      'Самобутні інтерпретації класичної музичної спадщини і сучасних творів, виняткової злагодженості оркестр і хор, талановиті солісти, яскраві й самобутні виконавські традиції дозволили театру досягти мистецьких вершин і посісти важливе місце в сьогоденній музичній культурі Європи.',
    ),
    Place(
      '2',
      const LatLng(50.445, 30.518611),
      'Національний академічний драматичний театр імені Лесі Українки',
      'Український театр у Києві, що займає приміщення колишнього театру Бергоньє',
    ),
    Place(
      '3',
      const LatLng(50.441696, 30.521141),
      'ПінчукАртЦентр',
      'PinchukArtCentre розташований в старовинному архітектурному ансамблі Бессарабського кварталу Києва це міжнародний центр сучасного мистецтва XXI сторіччя, відкрита платформа для митців, мистецтва та суспільства',
    ),
    Place('4', const LatLng(50.434167, 30.553333), 'Мистецький арсенал',
        'Національний культурно-мистецький та музейний комплекс «Мистецький арсенал», відкритий у Києві у 2007. Один з найбільших у Європі')
  ];

  return places;
}
